zero = {
        "Плотность, кг/м3": 1870.917728,
        "модуль упругости, ГПа":  1300.473921,
        "Количество отвердителя, м.%":  49.541585,
        "Содержание эпоксидных групп,%_2": 25.723873,
        "Температура вспышки, С_2":  281.111723,
        "Поверхностная плотность, г/м2":  406.763855,
        "Модуль упругости при растяжении, ГПа":  72.562999,
        "Прочность при растяжении, МПа":  2597.67771,
        "Потребление смолы, г/м2": 275.217434,
        "Угол нашивки, град":  0,
        "Шаг нашивки":  12.50172,
        "Плотность нашивки":  79.85646,
        "Cluster": 0
      }
zero_answer = 3.188971
first = {
        "Плотность, кг/м3": 1954.394536,
        "модуль упругости, ГПа":  501.727577,
        "Количество отвердителя, м.%":  51.135979,
        "Содержание эпоксидных групп,%_2" : 24.175471,
        "Температура вспышки, С_2":  206.794737,
        "Поверхностная плотность, г/м2":  182.426383,
        "Модуль упругости при растяжении, ГПа":  77.818203,
        "Прочность при растяжении, МПа":  2311.395581,
        "Потребление смолы, г/м2": 125.491763,
        "Угол нашивки, град":  90,
        "Шаг нашивки":  7.695706,
        "Плотность нашивки":  47.170554,
        "Cluster": 1
      }
first_answer = 3.864035
second = {
        "Плотность, кг/м3": 1958.695821,
        "модуль упругости, ГПа":  495.965686,
        "Количество отвердителя, м.%":  109.640875,
        "Содержание эпоксидных групп,%_2" : 23.367712,
        "Температура вспышки, С_2":  307.132922,
        "Поверхностная плотность, г/м2":  743.680084,
        "Модуль упругости при растяжении, ГПа":  70.541956,
        "Прочность при растяжении, МПа":  3245.59436,
        "Потребление смолы, г/м2": 213.035369,
        "Угол нашивки, град":  90,
        "Шаг нашивки":  10.026989,
        "Плотность нашивки":  62.612121,
        "Cluster": 2
      }
second_answer = 3.299063
third = {
        "Плотность, кг/м3": 1939.306891,
        "модуль упругости, ГПа":  956.971948,
        "Количество отвердителя, м.%":  100.210884,
        "Содержание эпоксидных групп,%_2" : 17.21857,
        "Температура вспышки, С_2":  279.944161,
        "Поверхностная плотность, г/м2":  360.510709,
        "Модуль упругости при растяжении, ГПа":  75.147487,
        "Прочность при растяжении, МПа":  2086.331974,
        "Потребление смолы, г/м2": 239.472375,
        "Угол нашивки, град":  0,
        "Шаг нашивки":  8.425411,
        "Плотность нашивки":  40.733647,
        "Cluster": 3
      }
third_answer = 2.700639
forty = {
        "Плотность, кг/м3": 1907.231491,
        "модуль упругости, ГПа":  320.046187,
        "Количество отвердителя, м.%":  133.790193,
        "Содержание эпоксидных групп,%_2" : 18.789287,
        "Температура вспышки, С_2":  357.274793,
        "Поверхностная плотность, г/м2":  202.585386,
        "Модуль упругости при растяжении, ГПа":  75.529836,
        "Прочность при растяжении, МПа":  2882.451195,
        "Потребление смолы, г/м2": 238.737603,
        "Угол нашивки, град":  90,
        "Шаг нашивки":  5.703059,
        "Плотность нашивки":  42.771428,
        "Cluster": 4
      }
forty_answer = 1.885174
fifty = {
        "Плотность, кг/м3": 1976.800187,
        "модуль упругости, ГПа":  315.664738,
        "Количество отвердителя, м.%":  130.477891,
        "Содержание эпоксидных групп,%_2" : 20.761966,
        "Температура вспышки, С_2":  187.562353,
        "Поверхностная плотность, г/м2":  582.95398,
        "Модуль упругости при растяжении, ГПа":  69.572035,
        "Прочность при растяжении, МПа":  1850.787485,
        "Потребление смолы, г/м2": 170.883503,
        "Угол нашивки, град":  0,
        "Шаг нашивки":  8.673996,
        "Плотность нашивки":  66.167001,
        "Cluster": 5
      }
fifty_answer = 2.862056
sixty = {
        "Плотность, кг/м3": 1985.995757,
        "модуль упругости, ГПа":  588.90807,
        "Количество отвердителя, м.%":  55.357623,
        "Содержание эпоксидных групп,%_2" : 22.055959,
        "Температура вспышки, С_2":  268.104579,
        "Поверхностная плотность, г/м2":  1291.340115,
        "Модуль упругости при растяжении, ГПа":  71.886116,
        "Прочность при растяжении, МПа":  2675.143157,
        "Потребление смолы, г/м2": 149.376123,
        "Угол нашивки, град":  90,
        "Шаг нашивки":  7.615874,
        "Плотность нашивки":  64.619238,
        "Cluster": 6
      }
sixty_answer = 1.827105
seventy = {
        "Плотность, кг/м3": 2012.822461,
        "модуль упругости, ГПа":  1040.570941,
        "Количество отвердителя, м.%":  108.923805,
        "Содержание эпоксидных групп,%_2" : 25.965307,
        "Температура вспышки, С_2":  301.909977,
        "Поверхностная плотность, г/м2":  1003.554958,
        "Модуль упругости при растяжении, ГПа":  71.955557,
        "Прочность при растяжении, МПа":  1872.739335,
        "Потребление смолы, г/м2": 359.05222,
        "Угол нашивки, град":  90,
        "Шаг нашивки":  6.224334,
        "Плотность нашивки":  47.385149,
        "Cluster": 7
      }
seventy_answer = 3.298776
eighty = {
        "Плотность, кг/м3": 1902.323754,
        "модуль упругости, ГПа":  809.682112,
        "Количество отвердителя, м.%":  138.490884,
        "Содержание эпоксидных групп,%_2" : 21.887169,
        "Температура вспышки, С_2":  282.363184,
        "Поверхностная плотность, г/м2":  79.879899,
        "Модуль упругости при растяжении, ГПа":  74.779541,
        "Прочность при растяжении, МПа":  3015.846986,
        "Потребление смолы, г/м2": 253.718185,
        "Угол нашивки, град":  90,
        "Шаг нашивки":  5.790341,
        "Плотность нашивки":  56.158437,
        "Cluster": 8
      }
eighty_answer = 3.400636
